# FolderPath Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceBrowserData..::..FolderPath Property
ExternalResourceBrowserData Class See Also
---
The current folder path to which the new resources and subfolder belong.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public string FolderPath { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FolderPath As String
	Get
```

Visual C++
---
```text
public:
property String^ FolderPath {
	String^ get ();
}
```

# See Also
ExternalResourceBrowserData Class
Autodesk.Revit.DB Namespace